{
    "items": [
        {"label":"EMF Customizer","type":"Project","description":"EMF Styling is a very simple model customization/refining CSS like textual DSL. The motivation is to address the problem of customizing/refining intermediate models in a Eclipse EMF based MDSD toolchain in order to be able to do incremental model generation while preserving user model refinements.","website:url":"https://github.com/cedricvidal/emf-customizer"},
        {"label":"EMF Scaffolding","type":"Project","description":"EMF Scaffolding allows interactive guided modeling by applying the scaffolding technic popularized by Ruby On Rails to the EMF modeling framework.","website:url":"https://github.com/cedricvidal/emf-scaffolding","image":"https://raw.githubusercontent.com/cedricvidal/emf-scaffolding/master/doc/inplace.png"},
        {"label":"JForkr","type":"Project","description":"JVM Forker and controller. Allows to fork a service in a separate JVM and remotely control it.","website:url":"https://github.com/cedricvidal/jforkr"},
        {"label":"Trans4j","type":"Project","description":"Trans4j is a dead simple Java Idiomatic Bean mapping framework. Trans4j doesn't support fancy and sophisticated mapping technics. We believe that at the end of the day, what you want is to easily write mapping code using straight Java code, with a framework that transparently takes care for you of nasty evil details such as graph cycles, caching and referencing partially created objects.","website:url":"http://code.google.com/p/trans4j/"},
        {"label":"PAX VFS","type":"Project","description":"Pax VFS integrates Apache Commons VFS into OSGi. It allows to dynamically register and unregister VFS providers in the OSGi registry. A secondary goal is to expose VFS filesystems as OSGi protocal handlers in order to leverage the rich set of existing VFS providers as OSGi protocol handlers.","website:url":"https://ops4j1.jira.com/wiki/spaces/ops4j/pages/9961483/Pax+VFS"},
        {"label":"Mavenizer","type":"Project","description":"Mavenizer est un outil pour Maven 2 permettant de faciliter la mavenization de librairies tierces, qui ne sont pas encore connues des dépôts Maven. Il tente de deviner les informations requises par Maven 2 telles que la version, le groupId, l’artifactId, la liste des dépendances, etc ...","website:url":"http://mavenizer.sourceforge.net/","image":"http://mavenizer.sourceforge.net/images/mavenizer-small.png"}
    ]
}
